OpenFOAM-dev/tutorials/multiphaseEuler/steamInjection/constant/phaseProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      phaseProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type thermalPhaseChangeMultiphaseSystem;

phases (steam water);

phaseChange on;

steam
{
    type            purePhaseModel;
    diameterModel   isothermal;
    isothermalCoeffs
    {
        d0              3e-3;
        p0              1e5;
    }

    residualAlpha   1e-3;
}

water
{
    type            purePhaseModel;
    diameterModel   none;

    residualAlpha   1e-3;
}

blending
{
    default
    {
        type            continuous;
        phase           water;
    }
}

surfaceTension
{}

saturationTemperature
{
    steam_water
    {
        type            constant;
        value           372.76;
    }
}

drag
{
    steam_dispersedIn_water
    {
        type            SchillerNaumann;
    }
}

virtualMass
{
    steam_dispersedIn_water
    {
        type            constantCoefficient;
        Cvm             0.5;
    }
}

heatTransfer
{
    steam_dispersedIn_water_inThe_steam
    {
        type spherical;
        residualAlpha 1e-3;
    }

    steam_dispersedIn_water_inThe_water
    {
        type RanzMarshall;
        residualAlpha 1e-3;
    }
}

phaseTransfer
{}

lift
{}

wallLubrication
{}

turbulentDispersion
{}

interfaceCompression
{}

// ************************************************************************* //
